## Quick python and numpy review

In [2]:
list = [1,2,3,4,5]
list.append(6)
list[0] = 10
print(list)

[10, 2, 3, 4, 5, 6]

In [3]:
# dictionaries
dict = {'name': 'John','age':30, 'city': 'Boston'}
dict['age'] = 35
print(dict)

{'name': 'John', 'age': 35, 'city': 'Boston'}

In [ ]:
#list comprehensions
squares = [x**2 for x in range(5)]
print(squares)

[0, 1, 4, 9, 16]

In [6]:
#lambda functions
add = lambda x,y: x+y
results = add(3,5)
print(results)

8

In [7]:
numbers = [1,2,3,4,5,6]
evens = [ x for x in numbers if x%2 == 0]
print(evens)

[2, 4, 6]

In [ ]:
import numpy as np
arr = np.array([1,2,3,4,5])
arr2d = np.array([[1,2,3,4,5],[8,9,6,8,9]])
arr = arr +10

print(arr)

[11 12 13 14 15]

lets start with pndas

In [2]:
import pandas as pd
import numpy as np
# xheck version
print(pd.__version__)

2.2.3

In [3]:
#create Series from list
s =pd.Series([10,20,30,40,50])
print(s)

#create Series with custom index
s = pd.Series([10,20,30], index = ['a','b','c'])
print(s)
#access elements 
print(s['a'])
print(s[0])

#series from dictionary
data = {'alice' : 95,'Bob': 87,'Charlie': 92}
grades = pd.Series(data)
print(grades)

0    10
1    20
2    30
3    40
4    50
dtype: int64
a    10
b    20
c    30
dtype: int64
10
10
alice      95
Bob        87
Charlie    92
dtype: int64

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_25740\1281877199.py:10: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(s[0])

In [5]:
#1.2 DataFrame(2d data
# A data frame is like excel sheeet rows and columns
#Method 1 : from dictionary
data = {
    'Name': ['Alice','Bob','Charlie','David'],
    'Age':[25,30,35,28],
    'city':['NYC','LA','Chicago','Boston'],
    'Salary': [70000,80000,75000,72000]
}
df=pd.DataFrame(data)
print(df)

#method 2 from list
data =[ ['Alice',25,'NYC'],
['Bob',30,'LA'],
['Charlie',34,'Chicago']]
df =pd.DataFrame(data,columns=['Name','Age','City'])
print(df)

#Method 3 : From Numpy Array
arr = np.array([[1,2,3],[4,5,6]])
df = pd.DataFrame(arr, columns = ['A','B','c'])
print(df)

#Method 4: from  list of dictionaries
data = [
    {'Name': 'Alice','age':30},
    {'Name': 'Bob','Age':30}
]
df =pd.DataFrame(data)
print(df)

      Name  Age     city  Salary
0    Alice   25      NYC   70000
1      Bob   30       LA   80000
2  Charlie   35  Chicago   75000
3    David   28   Boston   72000
      Name  Age     City
0    Alice   25      NYC
1      Bob   30       LA
2  Charlie   34  Chicago
   A  B  c
0  1  2  3
1  4  5  6
    Name   age   Age
0  Alice  30.0   NaN
1    Bob   NaN  30.0

# basics operations

In [7]:
#create sample Dataframe 
df =pd.DataFrame({
    'Name':['Alice','Bob','Charlie','Subodh','David','Eve'],
    'Age': [ 25,34,50,24,23,30],
    'City':['NYC','LA','Chicago','Kolkata','HyD','HTC'],
    'Salary':[70000,80000,90000,100000,110000,89000]})
df.head()

      Name  Age     City  Salary
0    Alice   25      NYC   70000
1      Bob   34       LA   80000
2  Charlie   50  Chicago   90000
3   Subodh   24  Kolkata  100000
4    David   23      HyD  110000